NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_lmac.svd
          <register>
            <name>IQRAWMEAN</name>
            <description>Mean of IQ values</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQRAWMEANI</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>IQRAWMEANQ</name>
                <description>Quadrature</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAGSTD</name>
            <description>Magnitude standard deviation approximation</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAGSTD</name>
                <description>Magnitude standard deviation approximation</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FFOEST</name>
            <description>FFO estimate</description>
            <addressOffset>0x034</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FFOEST</name>
                <description>Units 62.5 ppb. Max range +/-100 ppm plus margin.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DOWNSAMPLE</name>
            <description>Turn on/off down sample of input IQ-signals</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLEFILTER</name>
                <description>Turn on/off down sample of input IQ-signals</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Disable filter</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ON</name>
                    <description>Enable filter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RATE</name>
                <description>Indicating if BLE1M or BLE2M is used</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BLE1M</name>
                    <description>Radio mode BLE1M is used</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BLE2m</name>
                    <description>Deprecated enumerator -  Radio mode BLE2M is used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BLE2M</name>
                    <description>Radio mode BLE2M is used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FREQOFFSET</name>
            <description>Frequency offset estimate</description>
            <addressOffset>0x044</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FREQOFFSET</name>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RTT</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_RTT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1050</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>RTT Config.</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable RTT functionality. Only valid for BLE 1MBPS and 2MBPS mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable RTT Block</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable RTT Block</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENFULLAA</name>
                <description>Enabling/Disable ping over the entire access address.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable ping over the entire access address, i.e., enable only over the first 16-bit access address</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable ping over the entire access address</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ROLE</name>
                <description>Role as a Initiator or Reflector.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Initiator</name>
                    <description>Initiator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reflector</name>
                    <description>Reflector</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NUMSEGMENTS</name>
                <description>Number of 16bit payload segments available for ToA detection. Allowed values are 0, 2, 4, 6 and 8.</description>
                <lsb>3</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>EFSDELAY</name>
                <description>Early Frame Sync Delay, i.e., number of cycles to wait for access address to anchor correctly. For Ble_2Mbit, the EFSDELAY value is 64 (2us) and for Ble_1Mbit, it can be 256 (8us).</description>
                <lsb>8</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT01</name>
            <description>RTT segments 0 and 1</description>
            <addressOffset>0x0004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 31 - 0</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT23</name>
            <description>RTT segments 2 and 3</description>
            <addressOffset>0x0008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 63 - 32</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT45</name>
            <description>RTT segments 4 and 5</description>
            <addressOffset>0x000C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 95 - 64</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT67</name>
            <description>RTT segments 6 and 7</description>
            <addressOffset>0x0010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 127 - 96</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
